let array = {
  province: {
    "القاهرة شرق": {
      city: {
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
      },
    },
    "الإسما عيلية": {
      city: {
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
      },
    },
    "كفر الشيخ": {
      city: {
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
      },
    },
    "شمال سيناء": {
      city: {
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
      },
    },
    "قنا ": {
      city: {
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
        "ابشواى-العجميين": {
          exchanges: {
            "ابشو اى": "",
            "ابشو اى": "",
            "ابشو اى": "",
          },
        },
      },
    },
  },
};
